#include <stdio.h>
#include <string>
#include <iomanip>
using namespace std;

// 在一次晚会上，一位魔术师掏出一叠扑克牌，取出其中13张黑桃，预先洗好后，把牌面朝下，对观众说：“我不看牌，只数一数就能知道每张牌是什么？”魔术师口中念1，将第一张牌翻过来看正好是A；魔术师将黑桃A放到桌上，继续数手里的余牌，第二次数1，2，将第一张牌放到这叠牌的下面，将第二张牌翻开，正好是黑桃2，也把它放在桌子上。第三次数1，2，3，前面二张牌放到这叠牌的下面，取出第三张牌，正好是黑桃3，这样依次将13张牌翻出，准确无误。现在的问题是，魔术师手中牌的原始顺序是怎样的？
//1  8  2  5  10  3  12  11  9  4  7  6  13
int main(int argc, char* argv[])
{   
	int aa[14] = {0},j = 0;
	for (int i = 1; i <= 13; i++)
	{
		int b = 0;
		for (; b < i ;j++)
			if (0 == aa[j % 13 + 1]) 
				b++;
		aa[j % 13] = i;
	}
	aa[13] = aa[j%13];
	for (int i = 1; i <= 13; i++)
		cout << aa[i] << "  ";
	getchar();
	return 0;
}